XutaxKamay/pic18f4450_rtos/configure_bits.c

// PIC18F4450 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1L
#pragma config PLLDIV = 1 // PLL Prescaler Selection bits (No prescale (4
                          // MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2 // System Clock Postscaler Selection
                                  // bits ([Primary Oscillator Src: /1][96
                                  // MHz PLL Src: /2])
#pragma config USBDIV = 1 // USB Clock Selection bit (used in Full-Speed
                          // USB mode only; UCFG:FSEN = 1) (USB clock
                          // source comes directly from the primary
                          // oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = INTOSCIO_EC // Oscillator Selection bits (Internal
                                  // oscillator, port function on RA6, EC
                                  // used by USB (INTIO))
#pragma config FCMEN = OFF        // Fail-Safe Clock Monitor Enable bit
                                  // (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF // Internal/External Oscillator Switchover bit
                          // (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF  // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR  = OFF  // Brown-out Reset Enable bits (Brown-out Reset
                           // disabled in hardware and software)
#pragma config BORV   = 21 // Brown-out Reset Voltage bits (2.1V)
#pragma config VREGEN = OFF // USB Voltage Regulator Enable bit (USB
                            // voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF     // Watchdog Timer Enable bit (WDT disabled
                             // (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768 // Watchdog Timer Postscale Select bits
                             // (1:32768)

// CONFIG3H
#pragma config PBADEN = ON   // PORTB A/D Enable bit (PORTB<4:0> pins are
                             // configured as analog input channels on
                             // Reset)
#pragma config LPT1OSC = OFF // Low-Power Timer 1 Oscillator Enable bit
                             // (Timer1 configured for higher power
                             // operation)
#pragma config MCLRE = OFF // MCLR Pin Enable bit (RE3 input pin enabled;
                           // MCLR pin disabled)

// CONFIG4L
#pragma config STVREN = OFF // Stack Full/Underflow Reset Enable bit
                            // (Stack full/underflow will not cause Reset)
#pragma config LVP = ON // Single-Supply ICSP Enable bit (Single-Supply
                        // ICSP enabled)
#pragma config BBSIZ = BB1K // Boot Block Size Select bit (1KW Boot block
                            // size)
#pragma config ICPRT = OFF  // Dedicated In-Circuit Debug/Programming Port
                            // (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF  // Extended Instruction Set Enable bit
                            // (Instruction set extension and Indexed
                            // Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF // Code Protection bit (Block 0 (000800-001FFFh)
                         // or (001000-001FFFh) is not code-protected)
#pragma config CP1 = OFF // Code Protection bit (Block 1 (002000-003FFFh)
                         // is not code-protected)

// CONFIG5H
#pragma config CPB = OFF // Boot Block Code Protection bit (Boot block
                         // (000000-0007FFh) or (000000-000FFFh) is not
                         // code-protected)

// CONFIG6L
#pragma config WRT0 = OFF // Write Protection bit (Block 0
                          // (000800-001FFFh) or (001000-001FFFh) is not
                          // write-protected)
#pragma config WRT1 = OFF // Write Protection bit (Block 1
                          // (002000-003FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF // Configuration Register Write Protection bit
                          // (Configuration registers (300000-3000FFh) are
                          // not write-protected)
#pragma config WRTB = OFF // Boot Block Write Protection bit (Boot block
                          // (000000-0007FFh) or (000000-000FFFh) is not
                          // write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF // Table Read Protection bit (Block 0
                           // (000800-001FFFh) or (001000-001FFFh) is not
                           // protected from table reads executed in other
                           // blocks)
#pragma config EBTR1 = OFF // Table Read Protection bit (Block 1
                           // (002000-003FFFh) is not protected from table
                           // reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF // Boot Block Table Read Protection bit (Boot
                           // block (000000-0007FFh) or (000000-000FFFh)
                           // is not protected from table reads executed
                           // in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>